# MACHINE LEARNING

Machine learning is programming computers to optimize a performance criterion using example
data or past experience. We have a model defined up to some parameters, and learning is the
execution of a computer program to optimize the parameters of the model using the training data or
past experience. 

The model may be predictive to make predictions in the future, or descriptive to gain
knowledge from data, or both

A computer program is said to learn from experience E with respect to some class of tasks T and
performance measure P, if its performance at tasks T, as measured by P, improves with experience E.

# Machine Learning vs Artificial Learning

Machine learning is a subset of AI which allows a machine to automatically learn from past data without programming explicitly.

The goal of AI is to make a smart computer system like humans to solve complex problems.

The goal of ML is to allow machines to learn from data so that they can give accurate output.

# Scope of Machine Learning

The Future Scope of Machine Learning: Top Use Cases
“Machine learning is the process of automatically getting insights from data that can drive business value”, says Lavanya Tekumalla, founder and mentor. 

This is typically done in the following process:

1) Gathering and preparing large volumes of data that the machine will use to teach itself.
2) Feeding the data into ML models and training them to make right decisions through supervision and correction.
3) Deploying the model to make analytical predictions or feed with new kinds of data to expand its capabilities.

# Types of ML

In general, machine learning algorithms can be classified into three types:

1) Supervised learning
    - Regression
    - Classiffication
2) Unsupervised learning
    - Clustering
    - Market Basket Analysis
3) Reinforcement learning

# Real World Application

1. Image Recognition
2. Speech Recognition
3. Traffic prediction
4. Product recommendations
5. Self-driving cars
6. Email Spam and Malware Filtering
7. Virtual Personal Assistant
8. Online Fraud Detection
9. Stock Market trading
10. Medical Diagnosis
11. Automatic Language Translation

# Data Wrangling

Data Wrangling is a broad term used often from informally to describe the process of transforming the raw data to a clean and organized format ready for use for us.

The wrangling is only one step in processing our data.

The most common data structure used to wrangle data is the data frame, which can be both intuitive and incredibly versatile.

That the frames are tabular, meaning that they are based in rows and columns

In [1]:
import pandas as pd
 
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
dataframe = pd.read_csv(url)
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [4]:
dataframe.isna().sum()

Name          0
PClass        0
Age         557
Sex           0
Survived      0
SexCode       0
dtype: int64

In [5]:
dataframe.notna()

      Name  PClass   Age   Sex  Survived  SexCode
0     True    True  True  True      True     True
1     True    True  True  True      True     True
2     True    True  True  True      True     True
3     True    True  True  True      True     True
4     True    True  True  True      True     True
...    ...     ...   ...   ...       ...      ...
1308  True    True  True  True      True     True
1309  True    True  True  True      True     True
1310  True    True  True  True      True     True
1311  True    True  True  True      True     True
1312  True    True  True  True      True     True

[1313 rows x 6 columns]

In [6]:
dataframe.notnull()

      Name  PClass   Age   Sex  Survived  SexCode
0     True    True  True  True      True     True
1     True    True  True  True      True     True
2     True    True  True  True      True     True
3     True    True  True  True      True     True
4     True    True  True  True      True     True
...    ...     ...   ...   ...       ...      ...
1308  True    True  True  True      True     True
1309  True    True  True  True      True     True
1310  True    True  True  True      True     True
1311  True    True  True  True      True     True
1312  True    True  True  True      True     True

[1313 rows x 6 columns]

In [7]:
dataframe.isnull().sum(axis = 0)

Name          0
PClass        0
Age         557
Sex           0
Survived      0
SexCode       0
dtype: int64

In [8]:
dataframe.fillna(1)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

In [12]:
dataframe['Age'].fillna(value=dataframe['Age'].mean(),inplace=True)

In [13]:
dataframe

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

In [14]:
dataframe.isnull()

       Name  PClass    Age    Sex  Survived  SexCode
0     False   False  False  False     False    False
1     False   False  False  False     False    False
2     False   False  False  False     False    False
3     False   False  False  False     False    False
4     False   False  False  False     False    False
...     ...     ...    ...    ...       ...      ...
1308  False   False  False  False     False    False
1309  False   False  False  False     False    False
1310  False   False  False  False     False    False
1311  False   False  False  False     False    False
1312  False   False  False  False     False    False

[1313 rows x 6 columns]

In [20]:
dataframe.dropna(how='any',axis=1)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0